Revit 2024 API
STLExportOptions.ExportBinary Property
 True to export in binary STL format, false to export in ASCII STL format. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public bool ExportBinary { get; set; }
Visual Basic
Public Property ExportBinary As Boolean
	Get
	Set
Visual C++
public:
property bool ExportBinary {
	bool get ();
	void set (bool value);
}
See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace